In [1]:
# importing the libraries
import pandas as pd
import numpy as np

In [8]:
# importing the datasets
df = pd.read_csv('../data/Data.csv')
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [13]:
# working with iloc command
# integer-location [rows and then columns]

df.iloc[:4,:1]

   Country
0   France
1    Spain
2  Germany
3    Spain

In [26]:
# missing values handling
df.info()
print()
print()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 452.0+ bytes

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [45]:
missing = df['Salary'].isnull().sum()/df.shape[0] * 100
print(f"Percentage of missing values in Salary Columns is {missing} %")

Percentage of missing values in Salary Columns is 10.0 %

In [46]:
# deleting rows with missing values
df.dropna(subset='Salary', inplace=True)

In [49]:
# replacing missing value in age with mean
df['Age'].fillna(df['Age'].mean(), inplace=True)

In [51]:
df

   Country     Age   Salary Purchased
0   France  44.000  72000.0        No
1    Spain  27.000  48000.0       Yes
2  Germany  30.000  54000.0        No
3    Spain  38.000  61000.0        No
5   France  35.000  58000.0       Yes
6    Spain  38.625  52000.0        No
7   France  48.000  79000.0       Yes
8  Germany  50.000  83000.0        No
9   France  37.000  67000.0       Yes